# Напишите функцию pos_add(a, b),
# которая возвращает положительное значение сложения двух целых чисел.
def pos_add(a, b):
    result = a + b
    return result


print(pos_add(7, 9))
