# Напишите функцию округления round_standard(num),
# принимающую число с плавающей точкой и округляющую его до целого числа
# в соответствии с правилами школьной математики.
def round_standard(num):
    return round(num)


print(round_standard(1.5))
