# Дан объем шара X куб. ед. Найдите радиус фигуры.
from math import pi

print((3 * 82 / (4 * pi)) ** (1 / 3))
